app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST') {
            $login    = $this->request->getPost('login');
            $password = $this->request->getPost('password');

            // Admin shortcut
            if ($login === 'admin' && $password === 'admin123') {
                $this->session->set([
                    'userID'     => 1,
                    'name'       => 'Administrator',
                    'email'      => 'admin@lms.com',
                    'role'       => 'admin',
                    'isLoggedIn' => true
                ]);
                return redirect()->to(base_url('admin/dashboard'));
            }

            // Check DB
            $builder = $this->db->table('users');
            $user = $builder->where('email', $login)
                            ->orWhere('name', $login)
                            ->get()
                            ->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'jelajeminez8@gmail.com'
OR `name` = 'jelajeminez8@gmail.com'